{"business_address": "P O BOX 3707 MS 1F 31, SEATTLE, WA 98124", "ceo": "Dennis A. Muilenburg", "company_url": "www.boeing.com", "employees": 153027, "hq_address_city": "Wilmington", "hq_address_postal_code": "19808", "hq_country": "United States of America", "hq_state": "Washington", "industry_category": "Aerospace/Defense", "industry_group": "Aerospace/Defense Products & Services", "legal_name": "BOEING CO", "name": "Boeing Co", "sector": "Industrial Goods", "short_description": "The Boeing Co. is an aerospace company that manufactures commercial jetliners and defense, space and security systems. Its products and tailored services include commercial and military aircraft, satellites, weapons, electronic, and defense systems, launch systems, advanced information and communication systems, and performance-based logistics and training. The company is organized into three business units: Boeing Commercial Airplanes, Boeing Defense, Space & Security and Boeing Capital. The Commercial Airplanes segment develops, produces and markets commercial jet aircraft and provides related support services, principally to the commercial airline industry worldwide. Its Defense, Space & Security business comprises three segments: Boeing Military Aircraft, Network & Space Systems and Global Services & Support. The Boeing Military Aircraft segment is engaged in the research, development, production and modification of manned and unmanned military aircraft and weapons systems for global strike, including fighter and combat rotorcraft aircraft and missile systems; global mobility, including tanker, rotorcraft and tilt-rotor aircraft; and airborne surveillance and reconnaissance, including command and control, battle management and airborne anti-submarine aircraft. The Network & Space Systems segment is engaged in the research, development, production and modification of the following products and related services: electronics and information systems, including command, control, communications, computers, intelligence, surveillance and reconnaissance, cyber and information solutions, and intelligence systems; strategic missile and defense systems; space and intelligence systems, including satellites and commercial satellite launch vehicles; and space exploration. The Global Services & Support segment provides customers with mission readiness through total support solutions. Its global services business sustains aircraft and systems with a full spectrum of products and services through integrated logistics, including supply chain management and engineering support; maintenance, modification and upgrades for aircraft; and training systems and government services, including pilot and maintenance training. The Boeing Capital segment seeks to ensure that Boeing customers have the financing they need to buy and take delivery of their Boeing product and manages overall financing exposure. The company was founded by William Edward Boeing on July 15, 1916 and is headquartered in Chicago, IL.", "stock_exchange": "NYSE", "ticker": "BA"}