{"business_address": "170 WEST TASMAN DR, SAN JOSE, CA 95134-1706", "ceo": "Charles H. Robbins", "company_url": "www.cisco.com", "employees": 74200, "hq_address_city": "San Jose", "hq_address_postal_code": "95134", "hq_country": "United States of America", "hq_state": "California", "industry_category": "Computer Hardware", "industry_group": "Networking & Communication Devices", "legal_name": "CISCO SYSTEMS, INC.", "name": "Cisco Systems Inc", "sector": "Technology", "short_description": "Cisco Systems, Inc. designs, manufactures, and sells Internet Protocol based networking products and services related to the communications and information technology industry. It provides a broad line of products for transporting data, voice, and video within buildings and across campuses. The company's product offerings comprises of the following categories: Switching, Next-Generation Network (NGN) Routing, Service Provider Video, Collaboration, Data Center, Wireless, Security, and Other Products. Switching is a networking technology used in campuses, branch offices, and data centers. The Switches are used within buildings in local-area networks and across great distances in wide-area networks. Switching products offer many forms of connectivity to end users, workstations, IP phones, access points, and servers and also function as aggregators on local-area networks and wide-area networks. The Next-Generation Network Routing technology is fundamental to the foundation of the Internet. This category of technologies interconnects public and private wireline and mobile networks for mobile, data, voice, and video applications. The Service Provider Video delivers entertainment, information, and communication services to consumers and businesses around the world. The Collaboration portfolio integrates voice, video, data, and mobile applications on fixed and mobile networks across a wide range of devices and endpoints, including mobile phones, tablets, desktop and laptop computers, and desktop virtualization clients. The Unified Data Center unites computing, networking, storage, management, and virtualization into a single, fabric-based platform designed to increase and simplify operating efficiencies and provide business agility. The Wireless access via wireless fidelity (Wi-Fi) is a fast growing enterprise technology with companies and public institutions across the globe investing to provide indoor and outdoor coverage with seamless roaming for voice, video, and data applications. The Security portfolio of products and services offers identity, network, and content security solutions designed to enable customers to reduce the impact of threats and realize the benefits of a mobile, collaborative, and cloud-enabled business. Cisco's Collaboration portfolio integrates voice, video, data and mobile applications on fixed and mobile networks across a wide range of devices and endpoints from mobile phones and tablets to desktops, Macs and laptops to desktop virtualization clients. The firm operates through the following geographical segments: Americas, Europe, Middle East, Africa, Asia Pacific, Japan, and China. The company was founded by Sandra Lerner and Leonard Bosack on December 10, 1984 and is headquartered in San Jose, CA.", "stock_exchange": "NasdaqGS", "ticker": "CSCO"}