{"business_address": "500 SOUTH BUENA VISTA ST, BURBANK, CA 91521", "ceo": "Robert A. Iger", "company_url": "www.thewaltdisneycompany.com", "employees": 201000, "hq_address_city": "Burbank", "hq_address_postal_code": "91521-0001", "hq_country": "United States of America", "hq_state": "California", "industry_category": "Media", "industry_group": "Entertainment - Diversified", "legal_name": "WALT DISNEY CO/", "name": "Walt Disney Co, The", "sector": "Services", "short_description": "The Walt Disney Co. is a diversified international family entertainment and media enterprise. It operates through four business segments: Media Networks, Parks & Resorts, Studio Entertainment and Consumer Products & Interactive Media. The Media Networks segment includes cable and broadcast television networks, television production and distribution operations, domestic television stations, radio networks and stations. The Parks & Resorts segment owns and operates the Walt Disney World Resort in Florida; the Disneyland Resort in California; Aulani, a Disney Resort & Spa in Hawaii; the Disney Vacation Club; the Disney Cruise Line; and Adventures by Disney. The Studio Entertainment segment produces and acquires live-action and animated motion pictures, direct-to-video content, musical recordings and live stage plays. This segment distributes films primarily under the Walt Disney Pictures, Pixar, Marvel, Lucasfilm and Touchstone banners. The Consumer Products & Interactive Media segment licenses the company's trade names, characters and visual and literary properties to various manufacturers, game developers, publishers and retailers throughout the world. It also develops and publishes games, primarily for mobile platforms, and books, magazines and comic books. This segment also distributes branded merchandise directly through retail, online and wholesale businesses. In addition, the segment's operations also include website management and design, primarily for other company businesses, and the development and distribution of online video content. The Walt Disney was founded by Walter Elias Disney on October 16, 1923 and is headquartered in Burbank, CA.", "stock_exchange": "NYSE", "ticker": "DIS"}