{"business_address": "41 FARNSWORTH STREET, BOSTON, MA 02210", "ceo": "Jeff Immelt", "company_url": "www.ge.com", "employees": 283000, "hq_address_city": "Boston", "hq_address_postal_code": "02210", "hq_country": "United States of America", "hq_state": "Massachusetts", "industry_category": "Manufacturing", "industry_group": "Diversified Machinery", "legal_name": "GENERAL ELECTRIC CO", "name": "General Electric Co", "sector": "Industrial Goods", "short_description": "General Electric Co. is a technology and financial services company that develops and manufactures products for the generation, transmission, distribution, control and utilization of electricity. Its products and services include aircraft engines, power generation, water processing, security technology, medical imaging, business and consumer financing, media content and industrial products. The company operates through eight segments: Power & Water, Oil & Gas, Energy Management, Aviation, Healthcare, Transportation, Appliances & Lighting and GE Capital. The Power & Water segment serves power generation, industrial, government and other customers worldwide with products and services related to energy production. The Oil & Gas segment supplies mission critical equipment for the global oil and gas industry, used in applications spanning the entire value chain from drilling and completion through production, liquefied natural gas and pipeline compression, pipeline inspection, and downstream processing in refineries and petrochemical plants. The Energy Management segment designs technology solutions for the delivery, management, conversion and optimization of electrical power for customers across multiple energy-intensive industries. The Aviation segment products and services include jet engines, aerospace systems and equipment, replacement parts and repair and maintenance services for all categories of commercial aircraft; for a wide variety of military aircraft, including fighters, bombers, tankers and helicopters; for marine applications; and for executive and regional aircraft. The Healthcare segment products include diagnostic imaging systems such as magnetic resonance, computed tomography and positron emission Tomography scanners, X-ray, nuclear imaging, digital mammography and molecular imaging technologies. The Transportation segment engages in global technology and supplier to the railroad, mining, marine and drilling industries. The Appliances & Lighting segment products include major appliances and related services for products such as refrigerators, freezers, electric and gas ranges, cooktops, dishwashers, clothes washers and dryers, microwave ovens, room air conditioners, residential water systems for filtration, softening and heating, and hybrid water heaters. The GE Capital segment offers financial services and products worldwide for businesses of all sizes, services include commercial loans and leases, fleet management, financial programs, credit cards, personal loans and other financial services. The company was founded by Thomas A. Edison in 1878 and is headquartered in Boston, MA.", "stock_exchange": "NYSE", "ticker": "GE"}