{"business_address": "2200 MISSION COLLEGE BLVD, RNB-4-151, SANTA CLARA, CA 95054", "ceo": "Brian M. Krzanich", "company_url": "www.intel.com", "employees": 107400, "hq_address_city": "Santa Clara", "hq_address_postal_code": "95054", "hq_country": "United States of America", "hq_state": "California", "industry_category": "Electronics", "industry_group": "Semiconductor - Broad Line", "legal_name": "INTEL CORP", "name": "Intel Corp", "sector": "Technology", "short_description": "Intel Corp. designs, manufactures and sells computer components and related products. The company also engages in the designing and manufacturing of computing and communication components, such as microprocessors, chipsets, motherboards, and wireless and wired connectivity products. It develops advanced integrated digital technology products, primarily integrated circuits, for industries such as computing and communications. The company operates its business through the following segments: Client computing Group, Data Center Group, Internet of Things Group, Software & Services and All Other. The Client Computing Group segment includes platforms designed for the notebook, desktop, tablets, phones, wireless and wired connectivity products, and mobile communication components. The Data Center Group segment includes platforms designed for the enterprise, cloud, communications infrastructure, and technical computing segments. The Internet of Things Group segment offers platforms designed for Internet of Things market segments, including retail, transportation, industrial, and buildings and home use, along with other market segments. The Software & Services Operating segment includes software products designed to deliver innovative solutions that secure computers, mobile devices, networks, and software products and services that promote Intel architecture as the platform of choice for software development. Intel was founded by Robert Norton Noyce and Gordon Earle Moore on July 18, 1968 and is headquartered in Santa Clara, CA.", "stock_exchange": "NasdaqGS", "ticker": "INTC"}