{"business_address": "ONE JOHNSON & JOHNSON PLZ, NEW BRUNSWICK, NJ 08933", "ceo": "Alex Gorsky", "company_url": "www.jnj.com", "employees": 135100, "hq_address_city": "New Brunswick", "hq_address_postal_code": "08901", "hq_country": "United States of America", "hq_state": "New Jersey", "industry_category": "Drugs", "industry_group": "Drug Manufacturers - Major", "legal_name": "JOHNSON & JOHNSON", "name": "Johnson & Johnson", "sector": "Healthcare", "short_description": "Johnson & Johnson is an investment holding company with interests in health care products. It engages in research and development, manufacture and sale of personal care hygienic products, pharmaceuticals and surgical equipment. The company operates through the following business segments: Consumer, Pharmaceutical and Medical Devices. The Consumer segment includes products used in the baby care, skin care, oral care, wound care and women's health care fields, as well as nutritional and over-the-counter pharmaceutical products, and wellness and prevention platforms. The baby care franchise includes the JOHNSON'S Baby line of products. The Pharmaceutical segment includes products in the anti-infective, antipsychotic, contraceptive, gastrointestinal, hematology, immunology, infectious diseases, neurology, oncology, pain management, thrombosis and vaccines. The Medical Devices segment includes products distributed to wholesalers, hospitals and retailers, used principally in the professional fields by physicians, nurses, hospitals, and clinics. These include products to treat cardiovascular disease; orthopaedic and neurological products; blood glucose monitoring and insulin delivery products; general surgery, biosurgical, and energy products; professional diagnostic products; infection prevention products; and disposable contact lenses. Johnson & Johnson was founded by Robert Wood Johnson I, James Wood Johnson and Edward Mead Johnson Sr. in 1886 and is headquartered in New Brunswick, NJ.", "stock_exchange": "NYSE", "ticker": "JNJ"}