{"business_address": "270 PARK AVE, 38TH FL, NEW YORK, NY 10017", "ceo": "Jamie Dimon", "company_url": "www.jpmorganchase.com", "employees": 256105, "hq_address_city": "NEW YORK", "hq_address_postal_code": "10017", "hq_country": "United States of America", "hq_state": "New York", "industry_category": "Banking", "industry_group": "Money Center Banks", "legal_name": "JPMORGAN CHASE & CO", "name": "JPMorgan Chase & Co", "sector": "Financial", "short_description": "JPMorgan Chase & Co. is a financial holding company, which provides financial and investment banking services. It offers a range of investment banking products and services in all major capital markets, including advising on corporate strategy and structure; capital-raising in equity and debt markets; sophisticated risk management; market-making in cash securities and derivative instruments; and prime brokerage and research. It also offers investment banking, financial services for consumers, small business and commercial banking, financial transaction processing, asset management and private equity. The company operates its business through the following segments: Consumer and Community Banking; Corporate and Investment Bank; Commercial Banking; and Asset Management. The Consumer and Community Banking segment serves consumers and businesses through personal service at bank branches and through automated teller machine, online, mobile, and telephone banking. It is organized into Consumer and Business Banking, Mortgage Banking and Card, Merchant Services and Auto ('Card'). Consumer and Business banking offers deposit and investment products and services to consumers, and lending, deposit, and cash management and payment solutions to small businesses. Mortgage Banking includes mortgage origination and servicing activities, as well as portfolios comprised of residential mortgages and home equity loans, including the purchased credit impaired portfolio acquired in the Washington Mutual transaction. Card issues credit cards to consumers and small businesses, provides payment services to corporate and public sector clients through its commercial card products, offers payment processing services to merchants, and provides auto and student loan services. The Corporate and Investment Bank segment offers a broad suite of investment banking, market-making, prime brokerage, and treasury and securities products and services to a global client base of corporations, investors, financial institutions, government and municipal entities. This segment offers a full range of investment banking products and services in all major capital markets, including advising on corporate strategy and structure, capital-raising in equity and debt markets, as well as loan origination and syndication. The Commercial Banking segment delivers extensive industry knowledge, local expertise and dedicated service to United States (U.S.) and U.S. multinational clients, including corporations, municipalities, financial institutions, and non-profit entities. This segment provides financing to real estate investors and owners as well a s comprehensive financial solutions, including lending, treasury services, investment banking, and asset management to meet its client's domestic and international financial needs. The Asset Management segment provides investment and wealth management services. This segment offers investment management across all major asset services, including equities, fixed income, alternatives, and money market funds. The company was founded in 1968 and is headquartered in New York, NY.", "stock_exchange": "NYSE", "ticker": "JPM"}