{"business_address": "3M CENTER, BLDG. 220-11W-02, ST PAUL, MN 55144-1000", "ceo": "Inge G. Thulin", "company_url": "www.3m.com", "employees": 93516, "hq_address_city": "St. Paul", "hq_address_postal_code": "55144", "hq_country": "United States of America", "hq_state": "Minnesota", "industry_category": "Manufacturing", "industry_group": "Diversified Machinery", "legal_name": "3M CO", "name": "3M Co", "sector": "Industrial Goods", "short_description": "3M Co. is a diversified technology company, which manufactures industrial, safety and consumer products. The company operates its business through the following segments: Industrial, Safety & Graphics, Health Care, Electronics & Energy, and Consumer. The Industrial segment provides products, including tapes, abrasives, adhesives, specialty materials and filtration systems to diverse markets from purification to aerospace. The Safety & Graphics segment offers personal protective equipment, traffic safety & security products, commercial graphics systems, commercial cleaning & protection products, floor matting, roofing granules for asphalt shingles, and fall protection products. The Health Care segment supplies medical and surgical equipment, skin health & infection prevention products, drug delivery systems, dental & orthodontic products, health information systems and food safety products. The Electronics & Energy segment offers optical films solutions for electronic displays, packaging and interconnection devices; insulating and splicing solutions; touch screens and touch monitors; renewable energy component solutions; and infrastructure protection products. The Consumer segment provides sponges, scouring pads, high-performance cloths, consumer and office tapes, repositionable notes, indexing systems, home improvement products, home care products, protective material products, and consumer & office tapes, as well as adhesives. The company was founded by Henry S. Bryan, Hermon W. Cable, John Dwan, William A. McGonagle and J. Danley Budd in 1902 and is headquartered in St. Paul, MN.", "stock_exchange": "NYSE", "ticker": "MMM"}