{"business_address": "ONE BOWERMAN DR, BEAVERTON, OR 97005-6453", "ceo": "Mark G. Parker", "company_url": "about.nike.com/pages/company-profile", "employees": 73100, "hq_address_city": "Beaverton", "hq_address_postal_code": "97005-0979", "hq_country": "United States of America", "hq_state": "Oregon", "industry_category": "Consumer NonDurables", "industry_group": "Textile - Apparel Footwear & Accessories", "legal_name": "NIKE INC", "name": "Nike Inc", "sector": "Consumer Goods", "short_description": "NIKE, Inc. engages in the design, development, marketing, and sale of sports and lifestyle footwear, apparel, and equipment, accessories and services. Its athletic footwear products are designed primarily for specific athletic use, although a large percentage of the products are worn for casual or leisure purposes. It focuses on NIKE Brand and Brand Jordan product offerings in seven key categories: running, basketball, football, men's training, women's training, NIKE sportswear, and action sports. It also markets product designed for kids, as well as for other athletic and recreational uses such as baseball, cricket, golf, lacrosse, outdoor activities, football, tennis, volleyball, walking, and wrestling. The company sells a line of performance equipment under the NIKE Brand name, including bags, socks, sport balls, eyewear, timepieces, digital devices, bats, gloves, protective equipment, golf clubs, and other equipment designed for sports activities. It also sells small amounts of various plastic products to other manufacturers through its wholly-owned subsidiary, NIKE IHM, Inc. Its reportable operating segments for the NIKE Brand are: North America, Western Europe, Central & Eastern Europe, Greater China, Japan, and Emerging Markets. The company wholly-owned subsidiaries include Converse Inc., which designs, markets and distributes casual footwear, apparel and accessories and Hurley International LLC, which designs, markets and distributes action sports and youth lifestyle footwear, apparel and accessories. The company was founded by William Jay Bowerman and Philip H. Knight in 1964 and is headquartered in Beaverton, OR.", "stock_exchange": "NYSE", "ticker": "NKE"}